#-*-coding: utf-8 -*-

import xml.etree.cElementTree as ET

class Battle(object):
    def __init__(self):
        pass
    def play(self, person):
        # вывод текста
        # вывод параметров игрока: уровень здоровья, броня, оружие
        # вывод параметров врага: здоровье, броня (оружее?)
        # ввод: выбор оружия, выбор куда стрелять, выбор куда уклоняться
        # вывод результата дуэли. Возврат на вывод параметров, если оба живы
        # сообщение о победе или поражении. Возврат True или False соответственно
 
